app/controllers/events_controller.rb

  def find_events(time_range)
    @events = Event.find(:all,:conditions=>{:begin_time => time_range})
---
SELECT * FROM `events` WHERE (`events`.`begin_time` BETWEEN '2012-08-01' AND '2012-08-31')